In [44]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [54]:
data=pd.read_csv('housing.csv')
data.head()

      RM  LSTAT  PTRATIO      MEDV
0  6.575   4.98     15.3  504000.0
1  6.421   9.14     17.8  453600.0
2  7.185   4.03     17.8  728700.0
3  6.998   2.94     18.7  701400.0
4  7.147   5.33     18.7  760200.0

In [55]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 489 entries, 0 to 488
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   RM       489 non-null    float64
 1   LSTAT    489 non-null    float64
 2   PTRATIO  489 non-null    float64
 3   MEDV     489 non-null    float64
dtypes: float64(4)
memory usage: 15.4 KB

In [56]:
#convert in to 2D Arrays
data_array=data.values
data_array

array([[6.575e+00, 4.980e+00, 1.530e+01, 5.040e+05],
       [6.421e+00, 9.140e+00, 1.780e+01, 4.536e+05],
       [7.185e+00, 4.030e+00, 1.780e+01, 7.287e+05],
       ...,
       [6.976e+00, 5.640e+00, 2.100e+01, 5.019e+05],
       [6.794e+00, 6.480e+00, 2.100e+01, 4.620e+05],
       [6.030e+00, 7.880e+00, 2.100e+01, 2.499e+05]])

In [57]:
#Droping the PTRATIO column as it is not usefull here 
data=data.drop(['PTRATIO'],axis=1)
data.head()

      RM  LSTAT      MEDV
0  6.575   4.98  504000.0
1  6.421   9.14  453600.0
2  7.185   4.03  728700.0
3  6.998   2.94  701400.0
4  7.147   5.33  760200.0

In [58]:
data=data.rename(columns={"RM":"Avg No of Rooms", "LSTAT":"Percentage of lower status of the population","MEDV": "Median value of owner-occupied homes"})
data.head()

   Avg No of Rooms  ...  Median value of owner-occupied homes
0            6.575  ...                              504000.0
1            6.421  ...                              453600.0
2            7.185  ...                              728700.0
3            6.998  ...                              701400.0
4            7.147  ...                              760200.0

[5 rows x 3 columns]

In [59]:
index_col=np.arange(data.shape[0])
data.insert(0,'index',index_col)
data

     index  ...  Median value of owner-occupied homes
0        0  ...                              504000.0
1        1  ...                              453600.0
2        2  ...                              728700.0
3        3  ...                              701400.0
4        4  ...                              760200.0
..     ...  ...                                   ...
484    484  ...                              470400.0
485    485  ...                              432600.0
486    486  ...                              501900.0
487    487  ...                              462000.0
488    488  ...                              249900.0

[489 rows x 4 columns]

In [60]:
data.set_index('index',inplace=True)
data

       Avg No of Rooms  ...  Median value of owner-occupied homes
index                   ...
0                6.575  ...                              504000.0
1                6.421  ...                              453600.0
2                7.185  ...                              728700.0
3                6.998  ...                              701400.0
4                7.147  ...                              760200.0
...                ...  ...                                   ...
484              6.593  ...                              470400.0
485              6.120  ...                              432600.0
486              6.976  ...                              501900.0
487              6.794  ...                              462000.0
488              6.030  ...                              249900.0

[489 rows x 3 columns]

In [62]:
#slicing the dataset and taking only the first 200 elements
sm_elements=data[:200]
sm_elements

       Avg No of Rooms  ...  Median value of owner-occupied homes
index                   ...
0                6.575  ...                              504000.0
1                6.421  ...                              453600.0
2                7.185  ...                              728700.0
3                6.998  ...                              701400.0
4                7.147  ...                              760200.0
...                ...  ...                                   ...
195              6.162  ...                              506100.0
196              7.610  ...                              888300.0
197              7.853  ...                             1018500.0
198              5.891  ...                              474600.0
199              6.326  ...                              512400.0

[200 rows x 3 columns]